#вариант 31 
#Даны строки S и S0. Найти количество вхождений строки S0 в строку S.

S = input("Введите сточку S ")
S0 = input("Введите сточку S0 ")
print(f'Количество вхождений строки S0 в строку S: {S0.count(S)}') 
